Podkova/src/InformationRegisters/НастройкиИнтеграцииEDI/НастройкиИнтеграцииEDI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиИнтеграцииEDI</name>
  <resources>
    <name>АвтоматическиЗагружаемЗаказыКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиОбновляемЗаказыКлиента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>АвтоматическиОбновляемЗаказыПоставщикам</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтправляемЗаказыПоставщикамEDI</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтменятьСтрокиЗаказаКлиентаПриОтмене</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтменятьСтрокиЗаказаПоставщикуПриОтмене</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтменыСтрокЗаказаПоставщику</name>
    <type>
      <types>DefinedType.ПричинаОтменыСтрокЗаказаПоставщикуEDI</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтменыСтрокЗаказовКлиента</name>
    <type>
      <types>DefinedType.ПричинаОтменыСтрокЗаказаКлиентаEDI</types>
    </type>
  </resources>
  <resources>
    <name>ПрефиксНомеровДокументовСервис</name>
    <comment>Префикс номеров документов, создаваемых в сервисе 1С:EDI</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВариантОпределенияСкладаЗаказКлиента</name>
    <type>
      <types>EnumRef.ВариантыОпределенияСкладаВДокументахEDI</types>
    </type>
  </resources>
  <resources>
    <name>СкладУстанавливаемыйВЗагружаемыйЗаказаКлиента</name>
    <type>
      <types>DefinedType.СкладEDI</types>
    </type>
  </resources>
  <resources>
    <name>ОтветственныйПоУмолчаниюДляНовыхЗаказовКлиента</name>
    <type>
      <types>DefinedType.ПользовательEDI</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияEDI</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Podkova/src/Enums/ТипыИнтеграцииEDI/ТипыИнтеграцииEDI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыИнтеграцииEDI</name>
  <enumValues>
    <name>ВыполненоВстраиваниеВДокументы</name>
  </enumValues>
  <enumValues>
    <name>ИспользуетсяТолькоОбработка</name>
  </enumValues>
</mdclass:Enum>

Podkova/src/CommonModules/НастройкиEDI/Module.bsl
#Область ПрограммныйИнтерфейс

// Принимает значение Истина, если обмен с сервисом 1С:EDI используется.
// 
// Возвращаемое значение:
//  Булево - признак использования интеграции с 1C:EDI
//
Функция ИспользуетсяФункциональностьПодсистемы() Экспорт 
    
    Возврат ПолучитьФункциональнуюОпцию("ИспользоватьОбменEDI");
    
КонецФункции

// Предназначена для определения настроек учета в прикладной конфигурации
//
// Возвращаемое значение:
//  Структура - содержит поля:
//  * СоответствиеДокументовEDIПрикладнымОбъектам     - Соответствие - задает соответствие перечислению "Типы документов EDI" и типам соответствующих им прикладных документов.
//  * СоответствиеПрикладныхОбъектовДокументамEDI     - Соответствие - задает соответствие типов прикладных документов и перечисления "Типы документов EDI".
//  * ТипИнтеграции                                   - ПеречислениеСсылка.ТипыИнтеграцииEDI - какой вариант интеграции библиотеки выполнен, полное встраивание или используется только обработка.
//  * ИспользуетсяОтменаСтрокЗаказовКлиента           - Булево - признак того, что для заказов клиентов используется отмена строк заказов клиентов.
//  * ИспользуетсяОтменаСтрокЗаказовКлиента           - Булево - признак того, что в конфигурации используется причины отмены заказов клиента .
//  * ИспользуетсяОтменаСтрокЗаказовПоставщикам       - Булево - признак того, что используются причины отмены строк заказов поставщикам.
//  * ИспользуютсяПричиныОтменСтрокЗаказовПоставщикам - Булево - признак того, что в конфигурации используется причины отмены заказов поставщикам.
//
Функция НастройкиУчета() Экспорт
	
	НастройкиУчета = Новый Структура;
	НастройкиУчета.Вставить("СоответствиеДокументовEDIПрикладнымОбъектам",          СоответствиеДокументовEDIПрикладнымОбъектам());
	НастройкиУчета.Вставить("ТипИнтеграции",                                        Перечисления.ТипыИнтеграцииEDI.ИспользуетсяТолькоОбработка);
	НастройкиУчета.Вставить("ИспользуетсяОтменаСтрокЗаказовКлиента",                Ложь);
	НастройкиУчета.Вставить("ИспользуютсяПричиныОтменСтрокЗаказовКлиента",          Ложь);
	НастройкиУчета.Вставить("ИспользуетсяОтменаСтрокЗаказовПоставщикам",            Ложь);
	НастройкиУчета.Вставить("ИспользуютсяПричиныОтменСтрокЗаказовПоставщикам",      Ложь);
	НастройкиУчета.Вставить("ИспользуютсяСклады",                                   Ложь);
	НастройкиУчета.Вставить("ДоступноАвтоматическоеЗаполнениеСклада",               Ложь);
	НастройкиУчета.Вставить("ПредставлениеНастройкиАвтоматическогоЗаполненияСклада", "");
	НастройкиУчета.Вставить("ПояснениеМеханизмаАвтоматическогоЗаполненияСклада",     "");
	
	СервисEDIПереопределяемый.ПриОпределенииНастроекУчета(НастройкиУчета);
	
	НастройкиУчета.Вставить("СоответствиеПрикладныхОбъектовДокументамEDI", 
	                        СоответствиеПрикладныхОбъектовДокументамEDI(НастройкиУчета.СоответствиеДокументовEDIПрикладнымОбъектам));
	
	Возврат НастройкиУчета;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СоответствиеДокументовEDIПрикладнымОбъектам() Экспорт
	
	СоответствиеДокументовEDIПрикладнымОбъектам = Новый Соответствие;
	
	Для Инд =1 По Перечисления.ТипыДокументовEDI.Количество() Цикл
		
		ЗначениеПеречисления = Перечисления.ТипыДокументовEDI.Получить(Инд - 1);
		СоответствиеДокументовEDIПрикладнымОбъектам.Вставить(ЗначениеПеречисления, Неопределено);
		
	КонецЦикла;
	
	Возврат СоответствиеДокументовEDIПрикладнымОбъектам;
	
КонецФункции

Функция СоответствиеПрикладныхОбъектовДокументамEDI(СоответствиеДокументовEDIПрикладнымОбъектам) Экспорт
	
	СоответствиеПрикладныхОбъектовДокументамEDI = Новый Соответствие;
	
	Для Каждого ЭлементСоответствия Из СоответствиеДокументовEDIПрикладнымОбъектам Цикл
		
		 СоответствиеПрикладныхОбъектовДокументамEDI.Вставить(ЭлементСоответствия.Значение, ЭлементСоответствия.Ключ);
		
	КонецЦикла;
	
	Возврат СоответствиеПрикладныхОбъектовДокументамEDI;
	
КонецФункции

Функция ИспользуемыеТипыДокументов() Экспорт
	
	ИспользуемыеТипыДокументов = Новый Массив;
	
	НастройкиУчета = НастройкиУчета();
	
	Для Каждого ЭлементСоответствия Из НастройкиУчета.СоответствиеДокументовEDIПрикладнымОбъектам Цикл
		
		Если ЭлементСоответствия.Значение <> Неопределено Тогда
			 ИспользуемыеТипыДокументов.Добавить(ЭлементСоответствия.Ключ);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ИспользуемыеТипыДокументов;
	
КонецФункции

Функция ТипОрганизация() Экспорт
	
	ТипОрганизация = Неопределено;
	
	Для Каждого ТипОрганизация Из Метаданные.ОпределяемыеТипы.ОрганизацияEDI.Тип.Типы() Цикл
		
		МетаданныеПрикладногоОбъекта = Метаданные.НайтиПоТипу(ТипОрганизация);
		Если МетаданныеПрикладногоОбъекта = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не ОбщегоНазначения.ЭтоСсылка(ТипОрганизация) Тогда
			Продолжить;
		КонецЕсли;
		
		Возврат ТипОрганизация;
		
	КонецЦикла;
	
	Возврат ТипОрганизация;
	
КонецФункции

Функция ЕстьНастройкиОрганизаций() Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	НастройкиИнтеграцииEDI.Организация КАК Организация
	               |ИЗ
	               |	РегистрСведений.НастройкиИнтеграцииEDI КАК НастройкиИнтеграцииEDI";
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти
